HorseMa/uClinux-STM32/uClinux-dist/linux-2.4.x/drivers/usb/cy7c67300/usbd/dedev/de4_dev.h
/*******************************************************************************
 *
 * Copyright (c) 2003 Cypress Semiconductor
 *
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along 
 * with this program; if not, write to the Free Software Foundation, Inc., 
 * 59 Temple Place - Suite 330, Boston, MA 02111-1307, USA.
 *
 */

/*******************************************************************
 *
 *    DESCRIPTION: Function Driver header file for Design Example
 *                 Four.
 *
 *******************************************************************/

#ifndef DE4_DEV_H
#define DE4_DEV_H

#include "../../cy_ioctl.h"


typedef unsigned short uint16;
typedef unsigned char  uint8;

#define DE4_DEVICE_NAME           "de4"
#define DRIVER_NAME               "DE4 Function Driver"

#define DE4_DEVICE_CLASS          0x80
#define DE4_DEVICE_SUBCLASS       0x01
#define DE4_DEVICE_PROTOCOL       0

#define DE4_VENDOR_ID             0x04b4
#define DE4_PRODUCT_ID            0xde04

#define DE4_MANUFACTURER_STR      "Cypress Semiconductor"
#define DE4_PRODUCT_STR           "EZ-HOST"
#define DE4_SERIAL_NUMBER_STR     "2003.02.25"


#define CONTROL_EP               0x0
#define BULK_IN_EP               0x1
#define BULK_OUT_EP              0x2
#define BULK_OUT2_EP             0x3
#define TOTAL_ENDPOINTS          4

#define BULK_IN_BUFF_SZ          1024
#define USB_DE4_MINOR_BASE       0
#define MAX_DEVICES              1


/* BOOT PROTOCOL KEYBOARD HID REPORT STRUCT */

#define HID_REPORT_SIZE          0x8

typedef struct hid_keyboard_report_struct
{
    int valid;
    unsigned char report[HID_REPORT_SIZE];

} hid_keyboard_report_t;


#endif // DE4_DEV_H

